
const show = document.getElementById("demo");
var selectionStartt=0;
var selectionEndd=0;
var foo = ["ในxจจุบันอินเทอร์เน็ตนั้นมีความสำคัญต่อชีวิตประจำวันของคนเราหลายๆด้านทั้งด้านการศึกษาด้านธุรกิจและพาณิชย์ด้าน ",
"การบันเทิงด้านการศึกษาการใช้อินเทอร์เน็ตเพื่อการสนับสนุนการศึกษาป็นการใช้อินเทอร์เน็ตในการติดต่อสื่อสารเพื่อการส่ง ",
"การบ้านดหมายอธิบายรายละเอียดรวมทั้งแลกเปลี่ยน ",
"ความคิดเห็นของคณาจารย์กับนักเรียนและนักเรียนกับนักเรียนด้วยกัน",
"นอกจากนี้ยังมีระบบการเรียนการสอนด้วยระบบออนไลน์การเรียนออนไลน์ค่อนข้างเป็นที่นิยมมากในปัจจุบันเพราะเป็นการเรียน ",
"ที่สะดวกสามารถเรียนได้ในเวลาที่ต้องการกทั้งสามารถลดค่าเล่าเรียนลงไปได้อย่างมากและทั้งนี้อินเทอร์เน็ตนั้นยังสามารถใช้ ",
"เป็นแหล่งค้นคว้าหาข้อมูลเสมือนเป็นห้องสมุดขนาดใหญ่พร้อมทั้งมีข้อมูลที่ครอบคลุมมีทั้งภาพเสียงและภาพเคลื่อนไหวานธุรกิจ ",
"และพาณิชย์การใช้อินเทอร์เน็ตกับงานธุรกิจณิชย์นั้นช่วยให้สามารถตัดสินใจซื้อขายสินค้าและบริการได้อย่างรวดเร็วและสะดวก ",
"นับว่าเป็นตลาดที่กว้างขวางและมีประสิทธิภาพในการติดต่อซื้อสินค้าและบริการเพราะคนเราสมัยนี้นิยมความสะดวกสบายและ ",
"รวดเร็วทันใจไม่ว่าจะอยู่ที่ใดบนโลกก็ตามก็สามารถเปิดเว็บไซต์เพื่อเลือกสินค้าหรือหาข้อมูลผลิตภัณฑ์หรือแม้กระทั่งปรึกษาก็ได้ ",
"ฉับไวด้านการบันเทิงอินเทอร์เน็ตถือว่าเป็นแหล่งความบันเทิงในอีกรูปแบบหนึ่งเหมือนับการนั่งดูโทรทัศน์ดูภาพยนตร์อ่านหนังสือ ",
"หรือบทความต่างๆซึ่งสามารถจะดูหรือใช้งานที่ไหนเมื่อไหร่ก็ได้ตามต้องการอินเทอร์เน็ตต่อด้านบันเทิงนั้นถือว่าเป็นที่พักผ่อน ",
"หย่อนใจสามารถค้นคว้าวารสารทั้งหนังสือพิมพ์ข่าวสารนิยายวรรณกรรมและอื่นๆผ่านระบบเครือข่ายอินเทอร์เน็ตอีกทั้งสามารถ ",
"ฟังวิทยุออนไลน์ดูรายการโทรทัศน์รวมทั้งภาพยนตร์ทั้งเก่าและใหม่มาดูได้อีกด้วยภาษาไทยเป็นทั้งวัฒนธรรมและความภาคภูมิ ",
"ใจของคนไทยแต่ปัจจุบันคนไทยจำนวนไม่น้อยไม่รู้ว่าพยัญชนะสระและวรรณยุกต์ในภาษาไทยมีกี่รูปกี่เสียงและยังมีคนไทยอีก ",
"จำนวนมากที่ยังพูดภาษาไทยผิดบ้างเขียนผิดบ้างหรืออ่านผิดบ้างก็รวบรัดตัดตอนคำให้สั้นลงเพื่อความสะดวกจนเกิดปัญหา ",
"การสื่อสารและเข้าใจความหมายของภาษาในทางที่ผิดซึ่งสิ่งเหล่านี้อาจทำให้เสน่ห์ของภาษาไทยลดลงไปแม้ปัญหาการใช้ ",
"ภาษาไทยได้เกิดขึ้นมาเป็นระยะเวลาอันยาวนานหลายสิบปีแต่ในยุคปัจจุบันนี้ปัญหายิ่งวิกฤติความรุนแรงมากขึ้นเรื่อยๆซึ่ง ",
"มีปัจจัยหนุนนำที่สำคัญนั่นคือความก้าวหน้าทางเทคโนโลยีที่ก้าวล้ำไปอย่างรวดเร็วเราจึงพบการใช้ภาษาไทยแบบผิดๆมาก ",
"มายจนเกือบจะกลายเป็นความคุ้นชินโดยเฉพาะในกลุ่มวัยรุ่นยิ่งน่าเป็นห่วงมากที่สุดเป็นกลุ่มที่นิยมใช้ภาษาที่มีวิวัฒนาการ ",
"ทางภาษาที่เฉพาะกลุ่มซึ่งเป็นภาษาที่เกือบจะไม่มีไวยากรณ์ไม่ว่าจะจากการรับส่งข้อความสั้น(SMS)การส่งจดหมายอิเล็ก ",
"ทรอนิกส์(E-mail)การสนทนาออนไลน์(Line)หรือแม้แต่การแสดงความคิดเห็นในโลกอินเทอร์เน็ต ",
"(Facebook)สำหรับภาษาของวัยรุ่นที่พบเห็นกันบ่อยๆนั้นมีทั้งภาษาที่ใช้ในการพูดและเขียนโดยมักพูดหรือเนให้มี ",
"เสียงสั้นลงหรือยาวขึ้นเช่น“มโน”หมายถึงนึกคิดไปเองฝ่ายเดียว“จุงเบย”เป็นคำที่เพี้ยนมาจากคำว่าจังเลยเพื่อแสดงความ ",
"น่ารักอ่อนวัย“บ่องตง”มาจากคำว่าบอกตรงๆ“ฟิน”มาจากคำว่าฟินาเล่(Finale)ในภาษาอังกฤษหมายถึงจบแบบ ",
"สมบูรณ์แบบ“ฝุดฝุด”หมายถึงสุดๆไปเลย“เกรียน”เป็นคำพูดถึงการแสดงพฤติกรรมที่ไม่เหมาะสม“หงายเงิบ”เป็นคำ ",
"แสดงอาการตกใจจนแทบหงายหลังเป็นต้นและยังมีคำอีกมากมายที่ถูกบัญญัติขึ้นโดยกลุ่มผู้ใช้ที่เป็นวัยรุ่นและนับวันยิ่งขยา ",
"ยวงกว้างออกไปเรื่อยๆซึ่งปัญหาเหล่านี้หากทุกภาคส่วนในสังคมยังคงนิ่งเฉยไม่เร่งรีบหาทางแก้ไขและยังคงมีการใช้บ่อยๆก็จะ ",
"ทำให้เกิดความเคยชินอีกทั้งมีการนำไปใช้ในชีวิตประจำวันจนในที่สุดก็จะกลายเป็นเรื่องปกติซึ่งน่าหวั่นเกรงยิ่งนักว่าใน ",
"อนาคตปัญหาวิกฤตภาษาไทยก็จะยิ่งยากเกินการเยียวยาแก้ไข“ภาษาวัยรุ่น”ถึงเวลาก็ล้าสมัยไปเองโดยเรื่องนี้“คุณสุดใจ ",
"พรหมเกิด”ผู้จัดการแผนงานสร้างเสริมวัฒนธรรมการอ่านอธิบายว่าภาษาที่มีการบัญญัติคำศัพท์ใหม่ๆขึ้นมาใช้ในการสื่อสาร ",
"เฉพาะในกลุ่มหรือสังคมนั้นไม่ใช่เรื่องแปลกใหม่อะไรและไม่ควรวิตกกังวลเกินไปเพราะเป็นเพียงวิวัฒนากาภาษาที่เกิดขึ้นอยู่เรื่อยๆ ",
"โดยจะนิยมพูดกันช่วงเวลาสั้นๆตามกระแสเท่านั้นเช่นคำว่าจ๊าบ เจ๋ง โดนเป็นต้นเมื่อเวลาเลยผ่านไปคำศัพท์ยอดฮิตเหล่านี้ก็จะ ",
"ล้าสมัยไปเองคุณสุดใจบอกอีกว่าสิ่งหนึ่งที่สำคัญและน่าจะเป็นจุดเริ่มต้นที่ดีของการแก้ปัญหานี้คือการทำให้เยาวชนรุ่นใหม่ตระ ",
"หนักรู้ในคุณค่าของภาษาไทยด้วยการส่งเสริม“การอ่าน”เพราะการอ่านจะช่วยฝึกการออกเสียงตัวสะกดต่างๆของภาษาไทย ",
"ให้ถูกต้องรวมทั้งยังช่วยสร้างความสุนทรีย์ความคิดจินตนาการสร้างสรรค์ต่างๆได้อีกด้วยนอกจากนี้วัยเด็กยังเป็นวัยที่ซึมซับ ",
"ภาษาที่ดีได้อีกทางหนึ่ง“แบบเรียนหนังสือก็มีผลต่อการเรียนรู้ภาษาไทยเช่นกันดังน้ันเราต้องทำให้กระบวนการเรียนการสอน ",
"ของไทยก้าวไปสู่ศตวรรตที่21อย่างเต็มที่โดยเฉพาะการทำให้เด็กเกิดความใฝ่รู้อยากเรียนรู้ด้วยตัวเองต้องไม่ใช่การบังคับหรือยัด ",
"เยียดแต่ต้องเป็นการอ่านหนังสืออย่างมีความสุขการทำให้การอ่านเข้าไปอยู่ในวิถีชีวิตของเด็กในทุกช่วงวัโดยอาจจะเริ่มจากสมุด ",
"ภาพแล้วค่อยๆพัฒนาเป็นการอ่านวรรณกรรมที่มีเนื้อหามากขึ้นสิ่งเหล่านี้จะทำให้เด็กตระหนักถึงความสำคัญของภาษาไทยได้ ",
"ด้วยตัวเอง”ผู้จัดการแผนงานสร้างเสริมวัฒนธรรมการอ่านกล่าวเผย“ไลน์-เฟซบุ๊ค”ทำภาษาไทยเพี้ยนขณะที่ศูนย์วิจัยมหาวิท ",
"ยาลัยกรุงเทพ(กรุงเทพโพลล์)ได้สำรวจความคิดเห็นในหัวข้อ“ภาษาไทยบนสังคมออนไลน์ของคนรุ่นใหม่”พบว่าประชาชนส่วนให ",
"ญ่ร้อยละ84.7เห็นว่าการใช้ภาษาไทยในปัจจุบันเข้าขั้นวิกฤติและควรช่วยรณรงค์อย่างจริงจังส่วนผู้ที่มีอิทธิพลต่อการใช้ภาษาไทยใน ",
"ปัจจุบันมากที่สุดคือดารานักร้องร้อยละ36.0รองลงมาร้อยละ33.3คือสื่อมวลชนนักข่าวและร้อยละ19.2คือครูอาจารย์ส่วนร้อยละ ",
"38.8ให้เหตุผลที่มักนิยมใช้ภาษาไทยผิดเพี้ยนไปในสังคมออนไลน์ว่าใช้ตามๆกันจะได้เกาะกระแสรองลงมาร้อยละ32.4ให้เหตุผลว่า ",
"สะกดง่ายสั้นและสื่อสารได้เร็วและร้อยละ26.9ให้เหตุผลว่าเป็นคำที่ใช้แล้วรู้สึกขำและคลายเครียดได้การใช้ภาษาตามสมัยนิยมของ ",
"วัยรุ่นเพียงเพราะดูเป็นคำที่น่ารักและยังช่วยให้พิมพ์ง่ายขึ้นโดยที่ไม่คำนึงถึงสิ่งที่จะตามมานั่นคือการทำลายภาษาไทยทางอ้อม ",
"กลายเป็นสิ่งที่จะนำพาความวิบการภาษาไทยดังนั้นเราควรตระหนักถึงความสำคัญและคุณค่าของภาษาไทยซึ่งเป็นเอกลักษณ์ ",
"และเป็นสมบัติทางวัฒนธรรมอันล้ำค่าของชาติให้มีความถูกต้องงดงามคงอยู่คู่สังคมไทยตลอดไป ",
];
var min=2000; 
var max=3000;  
var text="";
var start = 0;
var startol;
var old = 0;
textSequence(0);
function textSequence(i) {
    if (foo.length > i) {
        setTimeout(function() {
             text = foo[i];
             show.value += foo[i]+"\n";
            //  TLN.append_line_numbers('demo');
            // console.log(text)
             textSequence(++i);  
            //  var sel = window.getSelection();
            //  sel.removeAllRanges();
            show.setSelectionRange(selectionStartt, selectionEndd);
            //   console.log("loop = "+selectionStartt);
             autoGrow(show);
        }, Math.round(Math.random() * (+max - +min) + +min) ); // time 
       
    }
}

document.onkeydown = checkKey;
function checkKey(e) {
    e = e || window.event;
    if (e.keyCode == 8) {
        selectionStartt = document.getElementById("demo").selectionStart;
        selectionEndd = document.getElementById("demo").selectionEnd;
        document.getElementById("demo").setSelectionRange( selectionStartt, selectionEndd);
        if(selectionStartt<=startol){
            alert("ข้อความถูกส่งออกไปแล้ว ไม่สามารถแก้ไขได้ หรือ ไม่ส่งซ้ำได้");
           return false;
       }
        selectionStartt=selectionStartt-1;
        selectionEndd=selectionEndd-1;
    }
}

document.getElementById('demo').addEventListener('keyup', e => {
    // console.log('index at: ', e.target.selectionStart)
    selectionStartt =  e.target.selectionStart;
    selectionEndd = e.target.selectionStart;
    document.getElementById("demo").setSelectionRange(selectionStartt,selectionEndd);   
  })

   // click 

function tt(){
    selectionStartt = document.getElementById("demo").selectionStart;
    selectionEndd = document.getElementById("demo").selectionEnd;
    //  console.log("click = "+selectionStartt);
    document.getElementById("demo").setSelectionRange( selectionStartt, selectionEndd);
}

/// read 

function readonly(){
    var el = document.getElementById("demo")
    var x2= el.value.slice(0, el.selectionStart).length;

    selectionStartt = document.getElementById("demo").selectionStart;
    selectionEndd = document.getElementById("demo").selectionEnd;
    // console.log(selectionStartt);
    document.getElementById("demo").setSelectionRange( selectionStartt, selectionEndd);
    selectionStartt=selectionStartt+1;
    selectionEndd=selectionEndd+1;

    if(x2<startol){
         alert("ข้อความถูกส่งออกไปแล้ว ไม่สามารถแก้ไขได้ หรือ ไม่ส่งซ้ำได้");
        return false;
    }
}

//// enter 

function runScript(e) {
     old = startol;
    if (e.keyCode == 13) {
        var el= document.getElementById('demo'); 
        var val = el.value;
        var x= val.slice(0, el.selectionStart).length;
        //  ห้ามกด ENTER
        if (old > x) {
             return false; 
        }
        console.log("index : "+x);
        var text = el.value.substring(start, x);
        console.log(text);
        $('.demo').highlightWithinTextarea({
            highlight: [
                {
                    highlight: [0,old],
                    className: 'highlight'
                },
                {
                    highlight: [start,x],
                    className: 'highlight2'
                }
            ],
        });
        start = val.slice(0, el.selectionStart).length;
        startol = start;
        return false; 
    }
    
}

document.querySelector('button').onclick = function(){
      id = document.getElementById('demo')
      var text = id.value;
      text = text.replace(/\n/g, "\r\n"); // To retain the Line breaks.
      var blob = new Blob([text], { type: "text/plain"});
      var anchor = document.createElement("a");
      anchor.download = "TEXT.txt";
      anchor.href = window.URL.createObjectURL(blob);
      anchor.target ="_blank";
      anchor.style.display = "none"; // just to be safe!
      document.body.appendChild(anchor);
      anchor.click();
      document.body.removeChild(anchor);
};

function autoGrow (oField) {
    if (oField.scrollHeight > oField.clientHeight) {
      oField.style.height = oField.scrollHeight + "px";
    }
  }


  $(function() {

     // Target a single one
    $("#paper-content").linedtextarea();
  
  });
  


   

