const WebSocket = require('ws');
const wss = new WebSocket.Server({ port: 8001 });
// สร้าง websockets server ที่ port 4000
console.log('run :8001');
wss.on('connection', function connection(ws) { // สร้าง connection
  ws.on('message', function incoming(message) {
   // รอรับ data อะไรก็ตาม ที่มาจาก client แบบตลอดเวลา
    console.log('received: %s', message);
  });
ws.on('close', function close() {
  // จะทำงานเมื่อปิด Connection ในตัวอย่างคือ ปิด Browser
    console.log('disconnected');
  });
// ws.send('init message to client');
  // ส่ง data ไปที่ client เชื่อมกับ websocket server นี้

    const data = ["ในxจจุบันอินเทอร์เน็ตนั้นมีความสำคัญต่อชีวิตประจำ",
    "วันของคนเราหลายๆด้านทั้งด้านการศึกษาด้านธุรกิจและพาณิชย์ด้าน ",
    "การบันเทิงด้านการศึกษาการใช้อินเทอร์เน็ตเพื่อการสนับสนุนการศึกษา",
    "ป็นการใช้อินเทอร์เน็ตในการติดต่อสื่อสารเพื่อการส่ง ",
    "การบ้านดหมายอธิบายรายละเอียดรวมทั้งแลกเปลี่ยน ",
    "ความคิดเห็นของคณาจารย์กับนักเรียนและนักเรียนกับนักเรียนด้วยกัน",
    "นอกจากนี้ยังมีระบบการเรียนการสอนด้วยระบบออนไลน์การ",
    "เรียนออนไลน์ค่อนข้างเป็นที่นิยมมากในปัจจุบันเพราะเป็นการเรียน ",
    "ที่สะดวกสามารถเรียนได้ในเวลาที่ต้องการกทั้งสามารถลดค่าเล่า",
    "เรียนลงไปได้อย่างมากและทั้งนี้อินเทอร์เน็ตนั้นยังสามารถใช้ ",
    "เป็นแหล่งค้นคว้าหาข้อมูลเสมือนเป็นห้องสมุดขนาดใหญ่พร้อม",
    "ทั้งมีข้อมูลที่ครอบคลุมมีทั้งภาพเสียงและภาพเคลื่อนไหวานธุรกิจ ",
    "และพาณิชย์การใช้อินเทอร์เน็ตกับงานธุรกิจณิชย์นั้นช่วยให้สามารถ",
    "ตัดสินใจซื้อขายสินค้าและบริการได้อย่างรวดเร็วและสะดวก ",
    "นับว่าเป็นตลาดที่กว้างขวางและมีประสิทธิภาพในการติดต่อซื้อสินค้า",
    "และบริการเพราะคนเราสมัยนี้นิยมความสะดวกสบายและ ",
    "รวดเร็วทันใจไม่ว่าจะอยู่ที่ใดบนโลกก็ตามก็สามารถเปิดเว็บไซต์เพื่อ",
    "เลือกสินค้าหรือหาข้อมูลผลิตภัณฑ์หรือแม้กระทั่งปรึกษาก็ได้ ",
    "ฉับไวด้านการบันเทิงอินเทอร์เน็ตถือว่าเป็นแหล่งความบันเทิงในอีก",
    "รูปแบบหนึ่งเหมือนับการนั่งดูโทรทัศน์ดูภาพยนตร์อ่านหนังสือ ",
    "หรือบทความต่างๆซึ่งสามารถจะดูหรือใช้งานที่ไหนเมื่อไหร่ก็ได้ตาม",
    "ต้องการอินเทอร์เน็ตต่อด้านบันเทิงนั้นถือว่าเป็นที่พักผ่อน ",
    "หย่อนใจสามารถค้นคว้าวารสารทั้งหนังสือพิมพ์ข่าวสารนิยายวรรณ",
    "กรรมและอื่นๆผ่านระบบเครือข่ายอินเทอร์เน็ตอีกทั้งสามารถ ",
    "ฟังวิทยุออนไลน์ดูรายการโทรทัศน์รวมทั้งภาพยนตร์ทั้งเก่าและ",
    "ใหม่มาดูได้อีกด้วยภาษาไทยเป็นทั้งวัฒนธรรมและความภาคภูมิ ",
    "ใจของคนไทยแต่ปัจจุบันคนไทยจำนวนไม่น้อยไม่รู้ว่าพยัญชนะ",
    "สระและวรรณยุกต์ในภาษาไทยมีกี่รูปกี่เสียงและยังมีคนไทยอีก ",
    "จำนวนมากที่ยังพูดภาษาไทยผิดบ้างเขียนผิดบ้างหรืออ่านผิด",
    "บ้างก็รวบรัดตัดตอนคำให้สั้นลงเพื่อความสะดวกจนเกิดปัญหา ",
    "การสื่อสารและเข้าใจความหมายของภาษาในทางที่ผิดซึ่งสิ่ง",
    "เหล่านี้อาจทำให้เสน่ห์ของภาษาไทยลดลงไปแม้ปัญหาการใช้ ",
    "ภาษาไทยได้เกิดขึ้นมาเป็นระยะเวลาอันยาวนานหลายสิบปีแต่",
    "ในยุคปัจจุบันนี้ปัญหายิ่งวิกฤติความรุนแรงมากขึ้นเรื่อยๆซึ่ง ",
    "มีปัจจัยหนุนนำที่สำคัญนั่นคือความก้าวหน้าทางเทคโนโลยีที่",
    "ก้าวล้ำไปอย่างรวดเร็วเราจึงพบการใช้ภาษาไทยแบบผิดๆมาก ",
    "มายจนเกือบจะกลายเป็นความคุ้นชินโดยเฉพาะในกลุ่มวัยรุ่น",
    "ยิ่งน่าเป็นห่วงมากที่สุดเป็นกลุ่มที่นิยมใช้ภาษาที่มีวิวัฒนาการ ",
    "ทางภาษาที่เฉพาะกลุ่มซึ่งเป็นภาษาที่เกือบจะไม่มีไวยากรณ์",
    "ไม่ว่าจะจากการรับส่งข้อความสั้น(SMS)การส่งจดหมายอิเล็ก ",
    "ทรอนิกส์(E-mail)การสนทนาออนไลน์(Line)หรือแม้แต่",
    "การแสดงความคิดเห็นในโลกอินเทอร์เน็ต ",
    "(Facebook)สำหรับภาษาของวัยรุ่นที่พบเห็นกันบ่อยๆนั้นมี",
    "ทั้งภาษาที่ใช้ในการพูดและเขียนโดยมักพูดหรือเนให้มี ",
    "เสียงสั้นลงหรือยาวขึ้นเช่น“มโน”หมายถึงนึกคิดไปเองฝ่าย",
    "เดียว“จุงเบย”เป็นคำที่เพี้ยนมาจากคำว่าจังเลยเพื่อแสดงความ ",
    "น่ารักอ่อนวัย“บ่องตง”มาจากคำว่าบอกตรงๆ“ฟิน”มาจาก",
    "คำว่าฟินาเล่(Finale)ในภาษาอังกฤษหมายถึงจบแบบ ",
    "สมบูรณ์แบบ“ฝุดฝุด”หมายถึงสุดๆไปเลย“เกรียน”เป็นคำ",
    "พูดถึงการแสดงพฤติกรรมที่ไม่เหมาะสม“หงายเงิบ”เป็นคำ ",
    "แสดงอาการตกใจจนแทบหงายหลังเป็นต้นและยังมีคำอีก",
    "มากมายที่ถูกบัญญัติขึ้นโดยกลุ่มผู้ใช้ที่เป็นวัยรุ่นและนับวันยิ่งขยา ",
    "ยวงกว้างออกไปเรื่อยๆซึ่งปัญหาเหล่านี้หากทุกภาคส่วนใน",
    "สังคมยังคงนิ่งเฉยไม่เร่งรีบหาทางแก้ไขและยังคงมีการใช้บ่อยๆก็จะ ",
    "ทำให้เกิดความเคยชินอีกทั้งมีการนำไปใช้ในชีวิตประจำวัน",
    "จนในที่สุดก็จะกลายเป็นเรื่องปกติซึ่งน่าหวั่นเกรงยิ่งนักว่าใน ",
    "อนาคตปัญหาวิกฤตภาษาไทยก็จะยิ่งยากเกินการเยียวยา",
    "แก้ไข“ภาษาวัยรุ่น”ถึงเวลาก็ล้าสมัยไปเองโดยเรื่องนี้“คุณสุดใจ ",
    "พรหมเกิด”ผู้จัดการแผนงานสร้างเสริมวัฒนธรรมการอ่าน",
    "อธิบายว่าภาษาที่มีการบัญญัติคำศัพท์ใหม่ๆขึ้นมาใช้ในการสื่อสาร ",
    "เฉพาะในกลุ่มหรือสังคมนั้นไม่ใช่เรื่องแปลกใหม่อะไรและ",
    "ไม่ควรวิตกกังวลเกินไปเพราะเป็นเพียงวิวัฒนากาภาษาที่เกิดขึ้นอยู่เรื่อยๆ ",
    "โดยจะนิยมพูดกันช่วงเวลาสั้นๆตามกระแสเท่านั้นเช่นคำว่า",
    "จ๊าบ เจ๋ง โดนเป็นต้นเมื่อเวลาเลยผ่านไปคำศัพท์ยอดฮิตเหล่านี้ก็จะ ",
    "ล้าสมัยไปเองคุณสุดใจบอกอีกว่าสิ่งหนึ่งที่สำคัญและน่าจะ",
    "เป็นจุดเริ่มต้นที่ดีของการแก้ปัญหานี้คือการทำให้เยาวชนรุ่นใหม่ตระ ",
    "หนักรู้ในคุณค่าของภาษาไทยด้วยการส่งเสริม“การอ่าน”",
    "เพราะการอ่านจะช่วยฝึกการออกเสียงตัวสะกดต่างๆของภาษาไทย ",
    "ให้ถูกต้องรวมทั้งยังช่วยสร้างความสุนทรีย์ความคิดจินตนา"
    ,"การสร้างสรรค์ต่างๆได้อีกด้วยนอกจากนี้วัยเด็กยังเป็นวัยที่ซึมซับ ",
    "ภาษาที่ดีได้อีกทางหนึ่ง“แบบเรียนหนังสือก็มีผลต่อการเรียน",
    "รู้ภาษาไทยเช่นกันดังน้ันเราต้องทำให้กระบวนการเรียนการสอน ",
    "ของไทยก้าวไปสู่ศตวรรตที่21อย่างเต็มที่โดยเฉพาะการทำ",
    "ให้เด็กเกิดความใฝ่รู้อยากเรียนรู้ด้วยตัวเองต้องไม่ใช่การบังคับหรือยัด ",
    "เยียดแต่ต้องเป็นการอ่านหนังสืออย่างมีความสุขการทำให้กา",
    "รอ่านเข้าไปอยู่ในวิถีชีวิตของเด็กในทุกช่วงวัโดยอาจจะเริ่มจากสมุด ",
    "ภาพแล้วค่อยๆพัฒนาเป็นการอ่านวรรณกรรมที่มีเนื้อหามาก",
    "ขึ้นสิ่งเหล่านี้จะทำให้เด็กตระหนักถึงความสำคัญของภาษาไทยได้ ",
    "ด้วยตัวเอง”ผู้จัดการแผนงานสร้างเสริมวัฒนธรรมการอ่านกล่าว",
    "เผย“ไลน์-เฟซบุ๊ค”ทำภาษาไทยเพี้ยนขณะที่ศูนย์วิจัยมหาวิท ",
    "ยาลัยกรุงเทพ(กรุงเทพโพลล์)ได้สำรวจความคิดเห็นในหัวข้อ",
    "“ภาษาไทยบนสังคมออนไลน์ของคนรุ่นใหม่”พบว่าประชาชนส่วนให ",
    "ญ่ร้อยละ84.7เห็นว่าการใช้ภาษาไทยในปัจจุบันเข้าขั้นวิกฤติ",
    "และควรช่วยรณรงค์อย่างจริงจังส่วนผู้ที่มีอิทธิพลต่อการใช้ภาษาไทยใน ",
    "ปัจจุบันมากที่สุดคือดารานักร้องร้อยละ36.0รองลงมาร้อยละ",
    "33.3คือสื่อมวลชนนักข่าวและร้อยละ19.2คือครูอาจารย์ส่วนร้อยละ ",
    "38.8ให้เหตุผลที่มักนิยมใช้ภาษาไทยผิดเพี้ยนไปในสังคม",
    "ออนไลน์ว่าใช้ตามๆกันจะได้เกาะกระแสรองลงมาร้อยละ32.4ให้เหตุผลว่า ",
    "สะกดง่ายสั้นและสื่อสารได้เร็วและร้อยละ26.9ให้เหตุผลว่า",
    "เป็นคำที่ใช้แล้วรู้สึกขำและคลายเครียดได้การใช้ภาษาตามสมัยนิยมของ ",
    "วัยรุ่นเพียงเพราะดูเป็นคำที่น่ารักและยังช่วยให้พิมพ์ง่ายขึ้น",
    "โดยที่ไม่คำนึงถึงสิ่งที่จะตามมานั่นคือการทำลายภาษาไทยทางอ้อม ",
    "กลายเป็นสิ่งที่จะนำพาความวิบการภาษาไทยดังนั้นเราควร",
    "ตระหนักถึงความสำคัญและคุณค่าของภาษาไทยซึ่งเป็นเอกลักษณ์ ",
    "และเป็นสมบัติทางวัฒนธรรมอันล้ำค่าของชาติให้มีความถูก",
    "ต้องงดงามคงอยู่คู่สังคมไทยตลอดไป ",
    ];
    // textSequence(0);
    function textSequence(i) {
        if (data.length > i) {
            setTimeout(function() {
                console.log('sending to data to client:', data[i])
                ws.send(data[i])
                textSequence(++i);  
            }, Math.round(Math.random() * (+5000 - +4000) + +4000) ); // time 
        
        }
    }
});


const wss2 = new WebSocket.Server({ port: 8005});
// สร้าง websockets server ที่ port 8005
console.log('run :8005');
wss2.on('connection', function connection(ws) { // สร้าง connection
    ws.on('message', function incoming(message) {
        // รอรับ data อะไรก็ตาม ที่มาจาก client แบบตลอดเวลา
        // console.log('received2: %s', message);
        ws.send(message);
    });
    ws.on('close', function close() {
        // จะทำงานเมื่อปิด Connection ในตัวอย่างคือ ปิด Browser
        console.log('disconnected');
    });
// ws.send('init messaasdasdadsadsad');

});